In [31]:
import pandas as pd
from scipy.stats import pearsonr, spearmanr
import matplotlib.pyplot as plt
import numpy as np

### Load the Data

In [3]:
df = pd.read_excel("TIESv4-1.xls")

In [5]:
df.head()

,caseid,startmonth,startday,startyear,endmonth,endday,endyear,ongoingasofmonth,ongoingasofday,ongoingasofyear,...,targeteconomiccostsfigure,targeteconomiccostscurrency,targeteconomiccostsyear,sendercosts,sendereconomiccostsfigure,sendereconomiccostscurrency,sendereconomiccostsyear,finaloutcome,settlementnaturesender,settlementnaturetarget
0,1945121601,12.0,16.0,1945,5.0,27.0,1947.0,NaN,NaN,NaN,...,NaN,NaN,NaN,1.0,NaN,NaN,NaN,8.0,2.0,8.0
1,1946020801,2.0,8.0,1946,6.0,19.0,1949.0,NaN,NaN,NaN,...,NaN,NaN,NaN,1.0,NaN,NaN,NaN,10.0,10.0,3.0
2,1946031101,3.0,11.0,1946,10.0,9.0,1993.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.0,10.0,2.0
3,1946040901,4.0,9.0,1946,8.0,3.0,1960.0,NaN,NaN,NaN,...,NaN,NaN,NaN,1.0,NaN,NaN,NaN,10.0,5.0,5.0
4,1946051001,5.0,10.0,1946,8.0,9.0,1946.0,NaN,NaN,NaN,...,90000000,dollars,1946.0,1.0,NaN,NaN,NaN,7.0,7.0,3.0

In [6]:
cow = pd.read_csv("COW-country-codes.csv")

In [8]:
cow.head()

  StateAbb  CCode                  StateNme
0      USA      2  United States of America
1      CAN     20                    Canada
2      BHM     31                   Bahamas
3      CUB     40                      Cuba
4      CUB     40                      Cuba

In [12]:
plty = pd.read_excel("POLITY5-PRC.xlsx")

In [16]:
autocratic_score = plty[plty['Indicator'] == 'Polity database: Institutionalized Autocracy Index']

In [23]:
# Ensure year columns are only numeric
year_columns = [col for col in autocratic_score.columns if col.isdigit()]

# Melt the DataFrame to reshape it with 'Year' as a series
melted_df_auto = autocratic_score.melt(id_vars=['Economy Name'], 
                           value_vars=year_columns, 
                           var_name='Year', 
                           value_name='Value')

# Convert 'Year' to integer for sorting or analysis
melted_df_auto['Year'] = melted_df_auto['Year'].astype(int)

# Sort the data
melted_df_auto = melted_df_auto.sort_values(['Economy Name', 'Year'])

In [29]:
melted_df_auto.head()

    Economy Name  Year  Value
0    Afghanistan  1776    NaN
166  Afghanistan  1777    NaN
332  Afghanistan  1778    NaN
498  Afghanistan  1779    NaN
664  Afghanistan  1780    NaN

### Autocracy and Number of Sanctions